Repository: tseli0s/FlText
Catalog: lib/l10n/app_*.arb
Languages: el, es, ru

source: Settings
el: Ρυθμίσεις
es: Configuración
ru: Настройки

source: About Fltext
el: Σχετικά με το Fltext
es: Acerca de Fltext
ru: О Fltext

# fltextDesc
source: FlText is a blazingly fast, lightweight text editor written in Dart using Flutter, designed to maintain usability without giving away on looks.
el: Το FlText είναι ένα γρήγορο, χαλαρό στην CPU πρόγραμμα επεξεργασίας κειμένου, γραμμένο με Dart και Flutter, σχεδιασμένο να παρέχει ταυτόχρονα ευχρηστία και ομορφιά στα μάτια.
es: FlText es un editor de texto rápido y eficiente en la CPU, escrito en Dart y Flutter, diseñado para proporcionar simultáneamente utilidad y belleza a la vista.
ru: FlText - это быстрый текстовый редактор, эффективный по использованию CPU, написанный на Dart и Flutter. Разработан для обеспечения одновременно удобства и красоты в глазах пользователя.

# githubRepo
source: GitHub Repository
el: Αποθετήριο GitHub
es: Repositorio en GitHub
ru: Репозиторий GitHub

source: Welcome to Fltext
el: Καλωσήρθατε στο Fltext
es: Bienvenido a Fltext
ru: Добро пожаловать в Fltext

source: Start by either...
el: Ξεκινήστε είτε...
es: Comience por...
ru: Начните с того, чтобы...

source: Creating a file...
el: Δημιουργώντας ένα αρχείο...
es: Creando un archivo...
ru: Создание файла...

source: or
el: ή
es: o
ru: или

source: Select a file...
el: Επιλέξτε ένα αρχείο...
es: Seleccionar un archivo...
ru: Выберите файл...

source: Too many files selected
el: Πολλαπλά αρχεία επιλέχθηκαν!
es: ¡Se han seleccionado demasiados archivos!
ru: Выбрано слишком много файлов!

# tooManyFilesSelected_t
source: Too many files were selected. FlText can only support one file at a time for now. Please choose only one file to edit.
el: Πολλαπλά αρχεία επιλέχθηκαν. Το FlText υποστηρίζει μόνο ένα αρχείο την φορά για τώρα. Παρακαλώ επιλέξτε μόνο ένα αρχείο για επεξεργασία.
es: Se han seleccionado demasiados archivos. FlText solo admite un archivo a la vez por ahora. Por favor, seleccione solo un archivo para editar.
ru: Выбрано слишком много файлов. FlText поддерживает только один файл одновременно на данный момент. Пожалуйста, выберите только один файл для редактирования.

source: Open an existing file...
el: Ανοίξτε ένα υπάρχων αρχείο...
es: Abrir un archivo existente...
ru: Открыть существующий файл...

source: New file...
el: Νέο αρχείο...
es: Nuevo archivo...
ru: Новый файл...

source: Close
el: Κλείσιμο
es: Cerrar
ru: Закрыть

source: Begin typing your text here...
el: Ξεκινήστε να πληκτρολογείτε το κείμενο σας εδώ...
es: Comience a escribir su texto aquí...
ru: Начните вводить текст здесь...

source: Loading...
el: Φόρτωση...
es: Cargando...
ru: Загрузка...

source: Error while loading file
el: Σφάλμα ενώ φορτωνόταν το αρχείο
es: Error al cargar el archivo
ru: Ошибка при загрузке файла

# thereWasAnErrorLoadingFile
source: There was an error while loading the file:
el: Εμφανίστηκε σφάλμα ενώ φορτωνόταν το επιλεγμένο αρχείο:
es: Se produjo un error al cargar el archivo seleccionado:
ru: Произошла ошибка при загрузке выбранного файла:

source: Edit file
el: Επεξεργασία αρχείου
es: Editar archivo
ru: Редактировать файл

source: Save file at...
el: Αποθήκευση αρχείου ως...
es: Guardar archivo como...
ru: Сохранить файл как...

source: Operation Cancelled
el: Η διεργασία ακυρώθηκε
es: Operación cancelada
ru: Операция отменена

# noFileWasSelected
source: No filename was selected, possibly because you cancelled the operation (Went back or closed the window). Try again.
el: Δεν επιλέχθηκε όνομα αρχείου, πιθανώς επειδή ακυρώσατε την διεργασία (Κλείσατε το παράθυρο ή πατήσατε 'πίσω'). Προσπαθήστε ξανά.
es: No se seleccionó ningún archivo, posiblemente porque canceló la operación (cerró la ventana o presionó 'atrás'). Intente nuevamente.
ru: Файл не был выбран, возможно, потому что вы отменили операцию (закрыли окно или нажали 'назад'). Попробуйте снова.

source: Editor font
el: Γραμματοσειρά επεξεργαστή
es: Fuente del editor
ru: Шрифт редактора

# editorFont_t
source: Set the font used by the text editor. By default, the system font is used.
el: Επιλέξτε την γραμματοσειρά που χρησιμοποιεί ο επεξεργαστής. Προεπιλεγμένη είναι αυτή του συστήματος.
es: Seleccione la fuente utilizada por el editor. La predeterminada es la fuente del sistema.
ru: Выберите шрифт, используемый редактором. По умолчанию установлен шрифт системы.

# saveSuccess
source: Saved succesfully.
el: Επιτυχής αποθήκευση.
es: Guardado exitoso.
ru: Успешное сохранение.

source: Warning
el: Προειδοποίηση
es: Advertencia
ru: Предупреждение

# androidWarning
source: On Android, you won't get a dialog to save the file because it's unsupported by the libraries we use. When you create a new file, you should get a dialog to enter the filename on Android. We know this is frustrating, and we apologize for any extra effort.
el: Σε συσκευές Android, δεν θα εμφανιστεί ένα παράθυρο για να αποθηκεύσετε ένα νέο αρχείο επειδή δεν υποστηρίζεται από τις βιβλιοθήκες λογισμικού που χρησιμοποιούνται. Όταν δημιουργήσετε ένα νέο αρχείο, θα πρέπει να σας ζητηθεί ένα όνομα αρχείου (Μόνο στο Android). Γνωρίζουμε ότι αυτό είναι ενοχλητικό, και ζητάμε συγγνώμη για τον περαιτέρω χρόνο που απαιτείται.
es: En dispositivos Android, no aparecerá una ventana para guardar un nuevo archivo porque no es compatible con las bibliotecas de software utilizadas. Al crear un nuevo archivo, se le pedirá un nombre de archivo (solo en Android). Sabemos que esto es molesto y pedimos disculpas por el tiempo adicional que esto requiere.
ru: На устройствах Android не будет отображено окно для сохранения нового файла, поскольку это не поддерживается используемыми программными библиотеками. При создании нового файла вам будет предложено ввести имя файла (только на Android). Мы знаем, что это неудобно, и приносим извинения за дополнительное время, необходимое для этого.

source: Select color
el: Επιλέξτε ένα χρώμα
es: Seleccionar un color
ru: Выберите цвет

source: Select color shade
el: Επιλέξτε μία απόχρωση
es: Seleccionar una tonalidad de color
ru: Выберите оттенок цвета

# selectedColorAndShades
source: Selected color and its shades
el: Επιλεγμένο χρώμα και αποχρώσεις αυτού
es: Color y tonalidades seleccionados
ru: Выбранный цвет и оттенки

source: Color scheme
es: Esquema de color
ru: Цветовая схема

# selectColorSchemeUsed
source: Select the color scheme used by the application
el: Επιλέξτε το color scheme που θα χρησιμοποιεί η εφαρμογή (Απαιτεί επανεκκίνηση)
es: Seleccione el esquema de color que usará la aplicación (requiere reinicio)
ru: Выберите цветовую схему, используемую приложением (требуется перезапуск)

source: Recents
el: Πρόσφατα
es: Recientes
ru: Последние

source: Unable to open URL
el: Αδυναμία ανοίγματος URL
es: No se puede abrir la URL
ru: Невозможно открыть URL

# anUnknownErrorOccured_URL
source: An unknown error occured while attempting to open the URL requested.
el: Ένα άγνωστο πρόβλημα προέκυψε κατά την προσπάθεια ανοίγματος του URL.
es: Se produjo un error desconocido al intentar abrir la URL.
ru: Произошла неизвестная ошибка при попытке открыть URL.

# filenameTitle
source: Enter filename...
el: Πληκτρολογήστε ένα όνομα αρχείου...
es: Escriba un nombre de archivo...
ru: Введите название файла...

# pleaseEnterFilename
source: Please enter the filename for your new text file here. It will be saved in your documents directory on Android/Fuschia. (No extension is added automatically!)
el: Παρακαλώ πληκτρολογήστε το όνομα του νέου αρχείου. Θα αποθηκευτεί στον φάκελο εγγράφων σας στο Android/Fuschia. (Δεν θα προστεθεί καμία κατάληξη αρχείου αυτόματα!)
es: Por favor, introduzca el nombre del nuevo archivo. Se guardará en su carpeta de documentos en Android/Fuschia. (¡No se añadirá ninguna extensión de archivo automáticamente!)
ru: Пожалуйста, введите название нового файла. Он будет сохранён в вашей папке документов на Android/Fuschia. (Расширение файла добавлено не будет автоматически!)

# errorCreatingNewFile
source: Error while creating new file
el: Προέκυψε σφάλμα κατά την προσπάθεια δημιουργίας του νέου αρχείου
es: Se produjo un error al intentar crear el nuevo archivo
ru: Произошла ошибка при попытке создать новый файл

source: Cancel
el: Ακύρωση
es: Cancelar
ru: Отмена
